Documents/LM_СписаниеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>LM_СписаниеОстатков</Name>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.LM_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.LM_Касса</xr:Item>
				<xr:Item>AccumulationRegister.LM_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Педагог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ГруппыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДисконтныеКарты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДенег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЗСписаниеКасса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.LM_ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/LM_СписанияСуммЗаУроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>LM_СписанияСуммЗаУроки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_Скидки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/LM_ДвижениеДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>LM_ДвижениеДисконтныхКарт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/LM_Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>LM_Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LM_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LM_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/LM_СписаниеОстатков/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Если Объект.Проведен Тогда //Отмена проведения
		Сообщить("Необходимо отменить проведение для формирования списания остатков!" );
		Возврат;
	КонецЕсли;

	Объект.ТЗСписания.Очистить();
	Объект.ДисконтныеКарты.Очистить();
	Объект.Сумма = 0;
	Объект.КоличествоЧасов = 0;
	Объект.СуммаБонусов = 0;
	
	Если ЗначениеЗаполнено(Объект.Ученик) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУрокиОстатки.Клиент КАК Клиент,
		|	СписанияСуммЗаУрокиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	СписанияСуммЗаУрокиОстатки.ПредметОбучения КАК ПредметОбучения,
		|	СписанияСуммЗаУрокиОстатки.ГруппаОбучения КАК ГруппаОбучения,
		|	СписанияСуммЗаУрокиОстатки.Тариф КАК Тариф,
		|	СписанияСуммЗаУрокиОстатки.ЧасыОстаток КАК ЧасыОстаток,
		|	СписанияСуммЗаУрокиОстатки.Педагог КАК Педагог,
		|	СписанияСуммЗаУрокиОстатки.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.Остатки(&Дата, ) КАК СписанияСуммЗаУрокиОстатки
		|ГДЕ
		|	СписанияСуммЗаУрокиОстатки.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ПредметОбучения,
		|	ГруппаОбучения
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Клиент", Объект.Ученик);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписанияСуммЗаУрокиОстатки.Клиент КАК Клиент,
		|	СписанияСуммЗаУрокиОстатки.ПредметОбучения КАК ПредметОбучения,
		|	СписанияСуммЗаУрокиОстатки.СуммаОстаток КАК СуммаОстаток,
		|	СписанияСуммЗаУрокиОстатки.ГруппаОбучения КАК ГруппаОбучения,
		|	СписанияСуммЗаУрокиОстатки.Тариф КАК Тариф,
		|	СписанияСуммЗаУрокиОстатки.ЧасыОстаток КАК ЧасыОстаток,
		|	СписанияСуммЗаУрокиОстатки.Педагог КАК Педагог,
		|	СписанияСуммЗаУрокиОстатки.Организация КАК Организация
		|ИЗ
		|	РегистрНакопления.LM_СписанияСуммЗаУроки.Остатки(&Дата, ) КАК СписанияСуммЗаУрокиОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ГруппаОбучения,
		|	ПредметОбучения
		|АВТОУПОРЯДОЧИВАНИЕ";		
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата),КонецДня(Объект.Дата),КонецДня(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ТЗСписания.Добавить();
		НовСтр.Ученик 			= ВыборкаДетальныеЗаписи.Клиент;
		НовСтр.Педагог 			= ВыборкаДетальныеЗаписи.Педагог;
		НовСтр.Тариф 			= ВыборкаДетальныеЗаписи.Тариф;
		НовСтр.ПредметОбучения 	= ВыборкаДетальныеЗаписи.ПредметОбучения;
		НовСтр.ГруппаОбучения 	= ВыборкаДетальныеЗаписи.ГруппаОбучения; 
		НовСтр.КоличествоЧасов 	= -ВыборкаДетальныеЗаписи.ЧасыОстаток;
		НовСтр.Сумма 			= -ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
	Объект.Сумма 			= Объект.ТЗСписания.Итог("Сумма");
	Объект.КоличествоЧасов 	= Объект.ТЗСписания.Итог("КоличествоЧасов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
	ОбновитьОтображение();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	Если Объект.ТЗСписаниеКасса.Количество() > 0 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаДокумент2;
	ИначеЕсли Объект.ДисконтныеКарты.Количество() > 0 Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаДокумент1;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиПоДисконтнымКартам(Команда)
	ЗаполнитьОстаткамиПоДисконтнымКартамНаСервере();
	ОбновитьОтображение();
КонецПроцедуры

Процедура ЗаполнитьОстаткамиПоДисконтнымКартамНаСервере()
	
	Если Объект.Проведен Тогда //Отмена проведения
		Сообщить("Необходимо отменить проведение для формирования списания остатков!" );
		Возврат;
	КонецЕсли;

	Объект.ДисконтныеКарты.Очистить();
	Объект.ТЗСписания.Очистить();
	Объект.Сумма = 0;
	Объект.СуммаБонусов = 0;
	Объект.КоличествоЧасов = 0;
	
	Если ЗначениеЗаполнено(Объект.Ученик) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДисконтныхКартОстатки.Клиент КАК Клиент,
		|	ДвижениеДисконтныхКартОстатки.СуммаБонусовОстаток КАК СуммаБонусовОстаток,
		|	ДвижениеДисконтныхКартОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта
		|ИЗ
		|	РегистрНакопления.LM_ДвижениеДисконтныхКарт.Остатки(&Дата, ) КАК ДвижениеДисконтныхКартОстатки
		|ГДЕ
		|	ДвижениеДисконтныхКартОстатки.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ДисконтнаяКарта
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Клиент", Объект.Ученик);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеДисконтныхКартОстатки.Клиент КАК Клиент,
		|	ДвижениеДисконтныхКартОстатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ДвижениеДисконтныхКартОстатки.СуммаБонусовОстаток КАК СуммаБонусовОстаток
		|ИЗ
		|	РегистрНакопления.LM_ДвижениеДисконтныхКарт.Остатки(&Дата, ) КАК ДвижениеДисконтныхКартОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент,
		|	ДисконтнаяКарта
		|АВТОУПОРЯДОЧИВАНИЕ"; 		
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата),КонецДня(Объект.Дата),КонецДня(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ДисконтныеКарты.Добавить();
		НовСтр.ДисконтнаяКарта	= ВыборкаДетальныеЗаписи.ДисконтнаяКарта;
		НовСтр.СуммаБонусов 	= ВыборкаДетальныеЗаписи.СуммаБонусовОстаток;
	КонецЦикла;
	
	Объект.СуммаБонусов 	= Объект.ДисконтныеКарты.Итог("СуммаБонусов");
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОстаткамиПоКассеНаСервере()
	
	Если Объект.Проведен Тогда //Отмена проведения
		Сообщить("Необходимо отменить проведение для формирования списания остатков!" );
		Возврат;
	КонецЕсли;
	
	Объект.ДисконтныеКарты.Очистить();
	Объект.ТЗСписания.Очистить();
	Объект.ТЗСписаниеКасса.Очистить();
	Объект.Сумма = 0;
	Объект.СуммаБонусов = 0;
	Объект.КоличествоЧасов = 0;
	
	Если ЗначениеЗаполнено(Объект.Ученик) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстатки.СуммаОстаток КАК СуммаОстаток,
		|	КассаОстатки.Касса КАК Касса
		|ИЗ
		|	РегистрНакопления.LM_Касса.Остатки(&Дата, ) КАК КассаОстатки
		|ГДЕ
		|	КассаОстатки.Клиент = &Клиент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Касса
		|АВТОУПОРЯДОЧИВАНИЕ";
		Запрос.УстановитьПараметр("Клиент", Объект.Ученик);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассаОстатки.СуммаОстаток КАК СуммаОстаток,
		|	КассаОстатки.Касса КАК Касса
		|ИЗ
		|	РегистрНакопления.LM_Касса.Остатки(&Дата, ) КАК КассаОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Касса
		|АВТОУПОРЯДОЧИВАНИЕ"; 		
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Дата),КонецДня(Объект.Дата),КонецДня(ТекущаяДата())));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ТЗСписаниеКасса.Добавить();
		НовСтр.Касса = ВыборкаДетальныеЗаписи.Касса;
		НовСтр.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
	Объект.Сумма = Объект.ТЗСписаниеКасса.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиПоКассе(Команда)
	ЗаполнитьОстаткамиПоКассеНаСервере();
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	 Если Объект.ТЗСписания.Количество()>0 Тогда
		Элементы.ГруппаДокумент.Заголовок = "Взаиморасчеты (" +Объект.ТЗСписания.Количество()+")";
	КонецЕсли;
	
	Если Объект.ДисконтныеКарты.Количество()>0 Тогда
		Элементы.ГруппаДокумент1.Заголовок = "Бонусы (" +Объект.ДисконтныеКарты.Количество()+")";
	КонецЕсли;
	
	Если Объект.ТЗСписаниеКасса.Количество()>0 Тогда
		Элементы.ГруппаДокумент2.Заголовок = "Касса (" +Объект.ТЗСписаниеКасса.Количество()+")";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ТЗСписанияПриИзменении(Элемент)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	С = Новый Структура;
	С.Вставить("Документ",Объект.Ссылка);
	ОткрытьФорму("Отчет.LM_ДвиженияДокумента.Форма.ДвиженияДокумента",С ,ЭтаФорма, , , , ,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
